src/app/controllers/donations_controller.rb

  def index
    @donations = Donation.all
---
SELECT "donations".* FROM "donations"