src/app/controllers/donations_controller.rb

  def create
    @donation = Donation.new(donation_params)

    respond_to do |format|
      if @donation.save
---
INSERT INTO "donations" ("name", "instrument", "condition", "model", "location", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @donation.update(donation_params)
---
UPDATE "donations" SET "location" = $1, "email" = $2, "updated_at" = $3 WHERE "donations"."id" = $4  [["location", "Skillman"], ["email", "riley@viola.com"], ["updated_at", "2020-04-27 07:26:56.594661"], ["id", 3]]

  def destroy
    @donation.destroy
---
DELETE FROM "donations" WHERE "donations"."id" = $1  [["id", 2]]

    def set_donation
      @donation = Donation.find(params[:id])
---
SELECT "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 68], ["LIMIT", 1]]