src/app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "yearLevel", "peopleNeeded", "instrumentsNeeded", "musicStyle", "location", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "location" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["location", "Montgomeryf"], ["updated_at", "2020-04-27 07:25:18.482892"], ["id", 7]]