src/app/controllers/lessons_controller.rb

INSERT INTO "lessons" ("name", "experience", "instrument", "location", "availability", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save

UPDATE "lessons" SET "availability" = $1, "updated_at" = $2 WHERE "lessons"."id" = $3  [["availability", "2d"], ["updated_at", "2020-04-27 07:43:05.306582"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @lesson.update(lesson_params)

DELETE FROM "lessons" WHERE "lessons"."id" = $1  [["id", 6]]
---
  def destroy
    @lesson.destroy